###Deletion Operation
-by using drop() method we can delete the data from a series

In [2]:
-syntax:series.drop(data,inplace=true)->Single data
    deletion
-syntax: series.drop(labels=[index1,index2],inplace=true)
    >mulltiple data deletion

SyntaxError: illegal target for annotation (1989190330.py, line 1)

In [88]:
#import pandas library
import pandas as pd

In [89]:
#to create a series data structure using list
sd1=pd.Series([10,20,30,'pyhton',45.6])
print(sd1)

0        10
1        20
2        30
3    pyhton
4      45.6
dtype: object

In [90]:
#example on drop( method)
sd1.drop(1,inplace=True)
sd1

0        10
2        30
3    pyhton
4      45.6
dtype: object

In [91]:
#to delete multiple records
sd1.drop(labels=[0,3,4],inplace=True)

In [92]:
sd1

2    30
dtype: object

###data insertion:
-concatenation metthod ->concat() to insert the new records into a series
-syntax: pd.concat([old_Series,new_series],ignore_index=TRUE)

In [93]:
# to insert multiple records into a series using concat()
s1=pd.Series([10,20,30])
print(s1)
s2=pd.Series(['Python','Java','Dbms'])
res=pd.concat([s1,s2],ignore_index=True)
res

0    10
1    20
2    30
dtype: int64

0        10
1        20
2        30
3    Python
4      Java
5      Dbms
dtype: object

# Data frame
1.data franme is used to store the data in the form of rows and columns
2.it is similar to the 2-D array
3.syntax:
varaible_name=pd.dataFrame(dict/2-d numpy)
4.By using Dictionary and 2-d numpy array we can create a dataframe

In [94]:
import pandas as pd

data = {'Name': ['keer', 'Vaishu', 'Bhagya', 'Puji', 'kitty', 'sam'],
        'Rno': [510, 423, 222, 104, 450, 523],
        'branch': ['Cse', 'Ece', 'Aiml', 'EEE', 'Civil', 'Mech']}

df = pd.DataFrame(data)
print(df)

     Name  Rno branch
0    keer  510    Cse
1  Vaishu  423    Ece
2  Bhagya  222   Aiml
3    Puji  104    EEE
4   kitty  450  Civil
5     sam  523   Mech

In [95]:
# to create a datframe usimg numpy 2-d array
import numpy as np
n1=np.array([[1,2,3],[4,5,6],[6,7,8]])
df1=pd.DataFrame(n1)
print(df1)
print(type(df1))

   0  1  2
0  1  2  3
1  4  5  6
2  6  7  8
<class 'pandas.core.frame.DataFrame'>

In [96]:
# to  print the dataframe
df

     Name  Rno branch
0    keer  510    Cse
1  Vaishu  423    Ece
2  Bhagya  222   Aiml
3    Puji  104    EEE
4   kitty  450  Civil
5     sam  523   Mech

In [97]:
df.columns

Index(['Name', 'Rno', 'branch'], dtype='object')

In [98]:
df.index
#to print the index nums

RangeIndex(start=0, stop=6, step=1)

In [99]:
#to print total number of rows
print(len(df))

6

In [100]:
df.shape

(6, 3)

# pandas indexing
-to access the data from a data frame
 using row indexing and coloumn names

In [101]:
# to print specific coloumn records data
df['Name']

0      keer
1    Vaishu
2    Bhagya
3      Puji
4     kitty
5       sam
Name: Name, dtype: object

In [102]:
#to print a datframe where specific cploumn names
df[['Name','branch']]

     Name branch
0    keer    Cse
1  Vaishu    Ece
2  Bhagya   Aiml
3    Puji    EEE
4   kitty  Civil
5     sam   Mech

In [103]:
#to print the first five records 
df.head()

     Name  Rno branch
0    keer  510    Cse
1  Vaishu  423    Ece
2  Bhagya  222   Aiml
3    Puji  104    EEE
4   kitty  450  Civil

In [104]:
#to print the last five records 
df.tail()

     Name  Rno branch
1  Vaishu  423    Ece
2  Bhagya  222   Aiml
3    Puji  104    EEE
4   kitty  450  Civil
5     sam  523   Mech

In [105]:
print(df.loc[1,'Name'])
print(df.iloc[1,0])

Vaishu
Vaishu

In [106]:
df.iloc[1]
#to print the sepcific row record
print(df.loc[[2,5],:])

     Name  Rno branch
2  Bhagya  222   Aiml
5     sam  523   Mech

In [107]:
# data filtering
print(df[df['branch']=='EEE'])

   Name  Rno branch
3  Puji  104    EEE

In [108]:
#to add new row record
df.loc[6]=['keerthi',437,'CSE']

In [109]:
df['Python_Marks']=[56,76,67,87,93,90,96]
print(df)

      Name  Rno branch  Python_Marks
0     keer  510    Cse            56
1   Vaishu  423    Ece            76
2   Bhagya  222   Aiml            67
3     Puji  104    EEE            87
4    kitty  450  Civil            93
5      sam  523   Mech            90
6  keerthi  437    CSE            96

In [110]:
df[df['Python_Marks']>=60]

      Name  Rno branch  Python_Marks
1   Vaishu  423    Ece            76
2   Bhagya  222   Aiml            67
3     Puji  104    EEE            87
4    kitty  450  Civil            93
5      sam  523   Mech            90
6  keerthi  437    CSE            96

In [111]:
#to update any specifivc value
df.loc[3,'rno']=111
df

      Name  Rno branch  Python_Marks    rno
0     keer  510    Cse            56    NaN
1   Vaishu  423    Ece            76    NaN
2   Bhagya  222   Aiml            67    NaN
3     Puji  104    EEE            87  111.0
4    kitty  450  Civil            93    NaN
5      sam  523   Mech            90    NaN
6  keerthi  437    CSE            96    NaN

# deletion opeartions
-using drop method we can delete the data frame from a datframe.

In [112]:
df.drop

<bound method DataFrame.drop of       Name  Rno branch  Python_Marks    rno
0     keer  510    Cse            56    NaN
1   Vaishu  423    Ece            76    NaN
2   Bhagya  222   Aiml            67    NaN
3     Puji  104    EEE            87  111.0
4    kitty  450  Civil            93    NaN
5      sam  523   Mech            90    NaN
6  keerthi  437    CSE            96    NaN>

In [113]:
#to delete the multiple records
df.drop(labels=[3,5],inplace=True)
df

      Name  Rno branch  Python_Marks  rno
0     keer  510    Cse            56  NaN
1   Vaishu  423    Ece            76  NaN
2   Bhagya  222   Aiml            67  NaN
4    kitty  450  Civil            93  NaN
6  keerthi  437    CSE            96  NaN

In [114]:
df.drop('branch',axis=1,inplace=True)
df
#to delete specific row records
#axis=0,rowwise
#axis=1,columnwise

      Name  Rno  Python_Marks  rno
0     keer  510            56  NaN
1   Vaishu  423            76  NaN
2   Bhagya  222            67  NaN
4    kitty  450            93  NaN
6  keerthi  437            96  NaN

# to rename the column name
-using rename() to rename the column names
-df.rename(columns={old_col:new_col},inplace=True)

In [115]:
#to rename the single column name
df.rename(Columns={'Name','Rno','Python_Marks'})

TypeError: DataFrame.rename() got an unexpected keyword argument 'Columns'

In [116]:
# to rename all the column names
df.columns=['Name','Rollnumber','Marks']
df

ValueError: Length mismatch: Expected axis has 4 elements, new values have 3 elements

In [117]:
#to rename the row indexx
df.index['A','B','C','D']
df

IndexError: only integers, slices (`:`), ellipsis (`...`), numpy.newaxis (`None`) and integer or boolean arrays are valid indices

In [118]:
#to delete all row record
df.drop(df.index,axis=0,inplace=True)
df

Empty DataFrame
Columns: [Name, Rno, Python_Marks, rno]
Index: []

In [120]:
df.drop(df.columns,axis=1,inplace=True)
df

Empty DataFrame
Columns: []
Index: []

In [122]:
df.columns=['name','Rno']
df

ValueError: Length mismatch: Expected axis has 0 elements, new values have 2 elements

# file input/output reading
by using read_csv() to read the .csv file
-syntax:
pd.read_csv('filename')